tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/verticalChannel/constant/porousZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
/*
    porousRegion // name of cell zone
    {
        coordinateSystem
        {
            e1  (1 0 0);
            e2  (0 1 0);
        }

        Darcy
        {
            d   d [0 -2 0 0 0 0 0] (500000 -1000 -1000);
            f   f [0 -1 0 0 0 0 0] (0 0 0);
        }
    }
*/
);

// ************************************************************************* //
